[
  {
    "id": 1,
    "name":"Minesweeper",
    "tagline": "The classic game, but in AngularJS",
    "short_description": "Relive your days of whittling away time in an office cubicle playing classic Minesweeper with this recreation. Win by unveiling all tiles which do not conceal mines, or flagging all the tiles which do.",
    "long_description": "This program will recreate the classic game of minesweeper. As a user, you can click tiles to reveal either a bomb or a clue to the number of bombs in the tiles around it. The goal is to clear the entire board without flipping over a tile with a bomb. This ends the game. The program uses an Angular Factory to create the board and its various properties such as tiles, bombs, difficulty, and size. A controller handles the playing logic and includes one of my proudest accomplishments. A recursive function that reveals tiles and calculates appropriate clues.",
    "image": "minesweeper2.png",
    "featured": true,
    "type_id": "game",
    "github_url": "https://github.com/abdcon02/April23_Minesweeper_AngularJS",
    "project_url": "minesweeper/index.html"
  },
  {
    "id": 2,
    "name":"Squid Chase",
    "tagline": "Get that Squid!",
    "short_description": "Squid Chase is a challenging game built using the p5.js library. p5.js follows the goals of Java&#39;s processing library which attempts to make coding accessible to artists and designers. Squid Chase mainly makes use of objects spatial awareness on the page.",
    "long_description": "This game challenges the user to chase an accelerating squid around the screen, accruing points for keeping the mouse in the target. It was built using the p5.js library. p5.js follows the goals of Java&#39;s processing library which attempts to make coding accessible to artists and designers. By adding vector properties to the squid object, and remembering some geometry from math class, it was possible to create a bouncing target. After adding some more logic for mouse events, and a score tracker, a nice little time wasting game was created.",
    "image": "http://placehold.it/350x150",
    "featured": false,
    "type_id": "game",
    "github_url": "https://github.com/abdcon02/April29_SquareGame_p5",
    "project_url": "/"
  },
  {
    "id": 3,
    "name":"Pizza Order",
    "url":"#",
    "order": 1,
    "short_description": "Hello World",
    "long_description": "A Longer Hello World",
    "image": "http://placehold.it/350x150",
    "featured": false
  },
  {
    "id": 4,
    "name":"Triangle Checker",
    "url":"#",
    "short_description": "Hello World",
    "long_description": "A Longer Hello World",
    "image": "http://placehold.it/350x150",
    "featured": false
  },
  {
    "id": 5,
    "name":"Student Roster",
    "url":"#",
    "short_description": "Hello World",
    "long_description": "A Longer Hello World",
    "image": "http://placehold.it/350x150",
    "featured": false
  },
  {
    "id": 6,
    "name":"Repeat Word Counter",
    "url":"#",
    "short_description": "Hello World",
    "long_description": "A Longer Hello World",
    "image": "http://placehold.it/350x150",
    "featured": false
  }
]